Repository: 4thel00z/pym
Catalog: */acknowledgment.po
Languages: ml_in

source: Acknowledgment
ml_in: കൃതജ്ഞത

source: I would like to thank the following people who have helped me make it through this book. Specially #fedora-docs in irc.freenode.net and also #fedora-art . Names are in alphabetic order:
ml_in: ഈ പുസ്തകത്തിന്റ‍െ രചനയില്‍ ഉടനീളം എന്നെ സഹായിച്ച എല്ലാവരോടും എന്റെ നന്ദി അറിയിക്കുന്നു.പ്രത്യേകിച്ചും edora-docs in irc.freenode.net കൂടാതെ fedora-art . Names :

source: Jared Smith
ml_in: ജേര്‍ഡ് സ്മിത്ത്

source: Marco Mornati
ml_in: മാര്‍ക്കോ മോര്‍ണതി

source: Nicu Buculei
ml_in: നിക്കു ബുക്കുലെ

source: Paul W. Frields
ml_in: പോള്‍ ഡബ്ല്യൂ. ഫ്രീ‍ല്‍സ്

source: Pradeepto K Bhattacharya
ml_in: പ്രദീപ്തോ കെ ഭട്ടാചാര്യ

source: Sankarshan Mukhopadhyay
ml_in: സങ്കര്‍ഷ‍‍ന്‍ മുഖോപാധ്യായ

source: Sayamindu Dasgupta
ml_in: സയമിന്ദു ദാസ്ഗുപ്ത

source: Stephanie Whiting
ml_in: സ്ററീഫന്‍ വൈററിങ്

source: I am missing some names in the above list, will add them soon
ml_in: മുകളിലത്തെ പട്ടികയില്‍ ചില പേരുകള്‍ വിട്ടുപോയിട്ടുണ്ട് ,അവ പിന്നീട് കൂട്ടിച്ചേര്‍ക്കുന്നതാണ്

source: I also took help from the following sites
ml_in: കൂടാതെ താഴെ പറയുന്ന സൈറ്റുകളില്‍ നിന്നും ഞാന്‍ സഹായം തേടിയിട്ടുണ്ട്

source: Few books or sites I would recommend to read
ml_in: കൂടുതല്‍ വായനക്കായി ചില പുസ്കങ്ങളും സൈററുകളും ഞാന്‍ നിര്‍ദ്ദേശിക്കുന്നു

source: Python Tutorial
ml_in: Python Tutoria
