Repository: 4thel00z/pym
Catalog: */ifelse.po
Languages: ml_in

source: If-else , the control flow
ml_in: if-else കണ്ട്രോള്‍ ഫ്ളോ

source: While working on real life of problems we have to make decisions. Decisions like which camera to buy or which cricket bat is better. At the time of writing a computer program we do the same. We make the decisions using if-else statements, we change the flow of control in the program by using them.
ml_in: നിത്യ ജീവിത്തില്‍ നമുക്ക് പലതരത്തിലുളള തീരുമാനങ്ങള്‍ കൈകൊള്ളേണ്ടതുണ്ട്.ഏതാണ് നല്ല ക്യാമറ നല്ല ക്രിക്കറ്റ് ബാറ്റ് ഏന്നിങ്ങനെ. കമ്പ്യൂട്ടര്‍ പ്രോഗ്രാം എഴുതുമ്പോഴും നമുക്ക് ഇത്തരത്തിലുള്ള ചില കാര്യങ്ങള്‍ ആവശ്യമായി വരും. അതിനായി നമുക്ക് if-else പ്രസ്താവന ഉപയോഗിക്കാവുന്നതാണ്, ഇവ ഉപയോഗിച്ച് നമുക്ക് പ്രോഗ്രാമിന്റെ ഗതി നിയന്ത്രിക്കുവാന്‍ സാധിക്കും.

source: If statement
ml_in: if പ്രസ്താവന

source: The syntax looks like
ml_in: if പ്രസ്താവനയുടെ വാക്യക്രമം ഇങ്ങനെയാണ്

source: If the value of <emphasis>expression</emphasis> is true (anything other than zero), do the what is written below under indentation. Please remember to give proper indentation, all the lines indented will be evaluated on the True value of the expression. One simple example is to take some number as input and check if the number is less than 100 or not.
ml_in: എക്സ്പ്രറഷന്‍റെ മൂല്യം സത്യമാകുകയാണെങ്കില്‍ ,കൃത്യമായ ഇന്‍ഡന്‍ഡേഷന്‍ നല്‍കാന്‍ ശ്രദ്ധിക്കുക.എക്സ്പ്രഷന്‍റെ സത്യമൂല്യം അനുസരിച്ച് ഇന്‍ഡന്‍റായി എഴുതിയിട്ടുള്ള വരികള്‍വിലയിരുത്തപ്പെടുന്നു.ഒരു ചെറിയ ഉദാഹരണം താഴെ കൊടുത്തിരിക്കുന്നു.ഇന്‍പുട്ടായി നല്‍കിയ സംഖ്യ 100 ല്‍ താഴെയാണോ അല്ലയൊ എന്നു പരിശോധിക്കുക.

source: Then we run it
ml_in: ഔട്ട്പുട്ട്

source: Else statement
ml_in: Else പ്രസ്താവന

source: Now in the above example we want to print "Greater than" if the number is greater than 100. For that we have to use the <emphasis>else</emphasis> statement. This works when the <emphasis>if</emphasis>statement is not fulfilled.
ml_in: ഇനി നമുക്ക് മുകളില്‍ കൊടുത്ത ഉദാഹരണത്തില്‍ ചെറിയ മാറ്റം വരുത്താം. സംഖ്യ 100 ല്‍ കൂടുതലാണെങ്കില്‍ ""Greater than'' എന്ന് അച്ചടിക്കത്തക്കവണ്ണം ഒരു പരിവര്‍ത്തനം.അതിനായി നമുക്ക് else പ്രസ്താവന ഉപയോഗിക്കാം.if പ്രസ്താവന സത്യമാകാത്ത സാഹചര്യത്തില്‍ else പ്രവര്‍ത്തിക്കുന്നു.

source: The output
ml_in: ഔട്ട്പുട്ട്

source: Another very basic example
ml_in: മറ്റൊരു ചെറിയ ഉദാഹരണം
