Repository: 4thel00z/pym
Catalog: */variablesanddatatypes.po
Languages: ml_in

source: Variables and Datatypes
ml_in: വേര്യബിളുകളും ഡാറ്റാടൈപ്പുകളും

source: Every programming language is having own grammar rules just like the other languages we speak.
ml_in: നാം സംസാരിക്കുന്ന ഭാഷയ്ക്കെന്നപോലെ പ്രോഗ്രാമിംങ് ഭാഷയ്ക്കും വ്യാകരണവും നിയമങ്ങളുമുണ്ട്.

source: Keywords and Identifiers
ml_in: കീ വേര്‍ഡുകളും ഐഡന്‍റിഫയറുകളും

source: Python codes can be divided into identifiers. Identifiers (also referred to as names) are described by the following lexical definitions:
ml_in: നാം എഴുതുന്ന പൈത്തണ്‍ പ്രോഗ്രാം സോഴ്സ് കോഡിനെ ഐഡന്‍റിഫയറുകളായി വിഭജിക്കാം.ഐഡന്‍റിഫയറുകളെ(names അഥവാ നാമങ്ങള്‍)താഴെ കൊടുത്തിരിക്കുന്ന ലെക്സിക്കന്‍ നിര്‍വചനങ്ങള്‍ കൊണ്ട് വിവരിക്കാം:

source: <![CDATA[ identifier ::= (letter|"_") (letter | digit | "_")* letter ::= lowercase | uppercase lowercase ::= "a"..."z" uppercase ::= "A"..."Z" digit ::= "0"..."9" ]]>
ml_in: <![CDATA[ identifier ::= (letter|"_") (letter | digit | "_")* letter ::= lowercase | uppercase lowercase ::= "a"..."z" uppercase ::= "A"..."Z"

source: This means <emphasis>_abcd</emphasis> is a valid identifier where as <emphasis>1sd</emphasis> is not. The following identifiers are used as reserved words, or keywords of the language, and cannot be used as ordinary identifiers. They must be spelled exactly as written here:
ml_in: ഇത് അര്‍ത്ഥമാക്കുന്നത് <emphasis>_abcd</emphasis> എന്നത് സാധുവായ ഒരു ഐഡന്‍റിഫയറാണ്, എന്നാല്‍ <emphasis>1sd</emphasis> എന്നത് അങ്ങിനെയല്ല.താഴെകൊടിത്തിരിക്കുന്ന ഐഡന്‍റിഫയറുകളെ റിസര്‍വ്ഡ് വാക്കുകളായോകീ വേര്‍ഡുകളായോ പൈത്തണ്‍ കണക്കാക്കുന്നു. ഈ കീ വേര്‍ഡുകളെ ഐഡന്‍റിഫയറായോ വേരിയബിളിന്റെ പേരായോ ഉപയോഗിക്കാന്‍ പാടില്ല.അവ താഴെ കൊടുത്തിരിക്കുന്നതുപോലെ തന്നെ ഉപയോഗിക്കേണ്ടതാണ്:

source: <![CDATA[ and del from not while as elif global or with assert else if pass yield break except import print class exec in raise continue finally is return def for lambda try ]]>
ml_in: <![CDATA[ and del from not while as elif global or with assert else if pass yield break except import print

source: In Python we don't specify what kind of data we are going to put in a variable. So you can directly write abc = 1 and abc will become an integer datatype. If you write abc = 1.0 abc will become of floating type. Here is a small program to add two given numbers
ml_in: പൈത്തണില്‍ നാം ഒരു വേരിയബിളില്‍ സൂക്ഷിക്കാന്‍ ഉദ്ദേശിക്കുന്ന ഡാറ്റ(വിവരം/ മൂല്ല്യം)യുടെ സ്വഭാവം നിര്‍വചിക്കാറില്ല. അതുകൊണ്ട് തന്നെ abc = 1 എന്ന് നമുക്ക് ഒരു വേരിയബിള്‍ മൂല്യം നല്‍കാം അപ്പോള്‍ abc ഒരു സംഖ്യാ മൂല്യം ഉള്‍ക്കൊള്ളുന്ന വേരിയബിളാകും. ഇനി abc = 1.0 എന്ന് എഴുതിയാല്‍ abc ഒരു floating മൂല്യമുള്ള വേരിയബിളാകും. തന്നിരിക്കുന്ന രണ്ട് സംഖ്യകളെത്തമ്മില്‍ കൂട്ടുന്നതിനുള്ള ഒരു പ്രോഗ്രാം താഴെക്കൊടുത്തിരിക്കുന്നു.

source: From the above example you can understand that to declare a variable in python , what you need is just to type the name and the value. Python can also manipulate strings They can be enclosed in single quotes or double quotes like
ml_in: പൈത്തണില്‍ ഒരു വേരിയബിള്‍ പ്രസ്താവിക്കാന്‍ പേരും അതിന്‍റെ മൂല്യവും നല്‍കുകയാണ് വേണ്ടതെന്ന് മുകളില്‍ നല്‍കിയിരിക്കുന്ന ഉദാഹരണത്തില്‍ നിന്നും താങ്കള്‍ക്ക് മനസിലായികാണുമല്ലോ.പൈത്തണ് സ്ട്രിങ് (string)മൂല്യത്തെയും പരിവര്‍ത്തനം (manipulation) ചെയ്യുവാന്‍ സാധിക്കും.സ്ട്രിങ് മൂല്യത്തെ സിംഗിള്‍ കോട്സിനകത്തോ ഡബിള്‍കോട്സിനകത്തോ ആയിരിക്കണം എഴുതേണ്ടത്.

source: Reading input from the Keyboard
ml_in: കീബോര്‍ഡില്‍ നിന്നും ഇന്‍പുട്ട് സ്വീകരിക്കുന്ന വിധം

source: Generally the real life python codes do not need to read input from the keyboard. In python we use raw_input function to do input. <emphasis>raw_input("String to show")</emphasis> , this will return a string as output. Let us write a program to read a number from the keyboard and check if it is less than 100 or not. Name of the program is testhundred.py
ml_in: സാധാരണ പൈത്തണ്‍ പ്രോഗ്രാമുകള്‍ കീബോര്‍ഡില്‍ നിന്നും ഇന്‍പുട്ട് സ്വീകരിക്കുന്നില്ല.raw_input function എന്ന ഫങ്ഷന്‍ ഉപയോഗിച്ച് നമുക്ക് കീബോര്‍ഡ് ഇന്‍പുട്ട് സ്വീകരിക്കാം.<emphasis>raw_input("String to show")</emphasis>,ഒരു ,സ്ട്രിങ് ഔട്ട്പുട്ടായി നല്‍കും.കീബോര്‍ഡ് ഇന്‍പുട്ടായി ഒരു നന്പര്‍ സ്വീകരിക്കുയും അത് 100 ന് തുല്യമോ താഴെയോ ആണെന്ന് പരിശോധിക്കുന്നതിന് ഒരു പ്രോഗ്രം എഴുതാം.ഈ പ്രോഗ്രാമിനെ നമുക്ക് testhundred.py എന്ന് സൂചിപ്പിക്കാം.

source: The output
ml_in: പ്രോഗ്രാമിന്‍റെ ഔട്ട്പുട്ട്

source: In the next program we are going to calculate investments.
ml_in: അടുത്തതായി നമുക്ക് നിക്ഷേപം കണക്കുകൂട്ടുന്നതിന് ഒരു പ്രോഗ്രാം തയ്യാറാക്കാം.

source: Some Examples
ml_in: ചില ഉദാഹരണങ്ങള്‍

source: Some examples of variables and datatypes:
ml_in: വേരിയബിളുകളും ഡാറ്റാടൈപ്പുകളും ഉപയോഗിക്കുന്നതു സംബന്ധിച്ച ചില ഉദാഹരണങ്ങള്‍ താഴെ കൊടുക്കുന്നു.

source: Average of N numbers
ml_in: N സംഖ്യകളുടെ ശരാശരി

source: In the next program we will do an average of N numbers.
ml_in: അടുത്ത പ്രോഗ്രാമില്‍ നമുക്ക് N സംഖ്യകളുടെ ശരാശരി കാണാം.

source: Temperature conversion
ml_in: താപനില പരിവര്‍‌ത്തനം

source: In this program we will convert the given temperature to Celsius from Fahrenheit by using the formula C=(F-32)/1.8
ml_in: ഈ പ്രോഗ്രാമില്‍ നമുക്ക് താപനിലയെ സെല്‍സ്യസില്‍ നിന്നും ഫാരന്‍ഹീറ്റിലേക്ക് പരിവര്‍ത്തനം ചെയ്യാം. പരിവര്‍ത്തനം ചെയ്യുന്നതിനുള്ള സൂത്രവാക്യം C=(F-32)/1.8

source: Multiple assignments in a single line
ml_in: ഒരേ സമയം ഒന്നലധികം വേരിയബിളിന് മൂല്യം നല്‍കല്‍

source: You can even assign values to multiple variables in a single line, like
ml_in: ഒരേ സമയം ഒരു നിരയില്‍ ഒന്നിലധികം വേരിയബിളുകള്‍ക്ക് മൂല്യം നല്‍കാന്‍ സാധിക്കും.

source: Using this swapping two numbers becomes very easy
ml_in: ഈ സങ്കേതം ഉപയോഗിച്ചുതന്നെ വേരിയബിള്‍ മൂല്യങ്ങളെ പരസ്പരം മാറ്റുവാനും സാധിക്കും.
